from dao import SportsEventDao
import sqlite3

# Инициализация DAO
dao = SportsEventDao('sports.db')

# Вставка данных
data = [
     ("2024-03-01 09:00", "Футбол", "Иванов И.И.", "Командные", 22),
    ("2024-03-01 10:00", "Баскетбол", "Петрова А.В.", "Командные", 10),
    ("2024-03-01 11:00", "Теннис", "Сидоров О.П.", "Индивидуальные", 2),
    ("2024-03-01 13:00", "Плавание", "Кузнецова Е.В.", "Индивидуальные", 8),
    ("2024-03-02 09:00", "Волейбол", "Морозов Д.С.", "Командные", 12),
    ("2024-03-02 10:00", "Бег", "Волкова Т.Н.", "Индивидуальные", 15),
    ("2024-03-02 12:00", "Хоккей", "Соколов А.М.", "Командные", 12),
    ("2024-03-03 09:00", "Шахматы", "Козлов П.Р.", "Индивидуальные", 2),
    ("2024-03-03 11:00", "Бадминтон", "Лебедева И.М.", "Индивидуальные", 4),
    ("2024-03-03 13:00", "Регби", "Павлова С.А.", "Командные", 30),
    ("2024-03-04 10:00", "Гимнастика", "Егорова В.Д.", "Индивидуальные", 5),
    ("2024-03-04 11:00", "Бокс", "Андреев К.П.", "Индивидуальные", 2),
    ("2024-03-04 13:00", "Фехтование", "Зайцева М.В.", "Индивидуальные", 2),
    ("2024-03-05 09:00", "Легкая атлетика", "Титова Ю.С.", "Индивидуальные", 20),
    ("2024-03-05 10:00", "Гандбол", "Семенов Г.А.", "Командные", 14),
    ("2024-03-05 12:00", "Каратэ", "Орлова Н.Н.", "Индивидуальные", 2),
    ("2024-03-06 09:00", "Йога", "Антонова Е.В.", "Индивидуальные", 10),
    ("2024-03-06 11:00", "Пауэрлифтинг", "Филиппов Д.С.", "Индивидуальные", 6),
    ("2024-03-06 13:00", "Скалолазание", "Максимова О.Ю.", "Индивидуальные", 8),
    ("2024-03-07 10:00", "Сноубординг", "Комаров А.И.", "Индивидуальные", 5)
]

for event in data:
    try:
        dao.insert_event(event)
    except sqlite3.IntegrityError:
        print(f"Запись {event} уже существует и не будет добавлена.")

# Вставка данных о местоположении событий
locations = [
    (1, "Стадион Лужники"),
    (2, "Баскетбольный зал Олимпийский"),
    (3, "Теннисный корт Центральный"),
    # Добавьте остальные местоположения
]

for event_id, location in locations:
    try:
        dao.insert_event_location(event_id, location)
    except sqlite3.IntegrityError:
        print(f"Местоположение для события {event_id} уже существует и не будет добавлено.")

# Запрос 1: Вывод всех данных
print("Все данные:")
for row in dao.get_all_events():
    print(row)

# Запрос 2: Вывод всех командных видов спорта
print("\nКомандные виды спорта:")
for row in dao.get_team_sports():
    print(row)

# Запрос 3: Вывод всех событий с количеством участников больше 10
print("\nСобытия с количеством участников больше 10:")
for row in dao.get_events_with_more_than_10_participants():
    print(row)

# Запрос 4: Вывод всех событий с их местоположениями
print("\nСобытия и их местоположения:")
for row in dao.get_event_locations():
    print(row)

# Закрытие соединения
dao.close() 